CREATE TABLE fauna
(
    id             SERIAL PRIMARY KEY,
    name           TEXT,
    avg_age        INT,
    discovery_date DATE
);

INSERT INTO fauna(name, avg_age, discovery_date)
VALUES ('Кошка домашняя', 5475, DATE '1758-01-01'),
       ('Собака домашняя', 4745, DATE '1758-01-01'),
       ('Попугай жако', 18250, DATE '1758-01-01'),
       ('Галапагосская черепаха', 36500, DATE '1827-01-01'),
       ('Африканский саванный слон', 25550, DATE '1797-01-01'),
       ('Майский жук западный', 365, DATE '1758-01-01'),
       ('Тигровая акула', 9855, DATE '1822-01-01'),
       ('Дельфин-белобочка', 9125, DATE '1766-01-01'),
       ('Красная панда', 5110, DATE '1825-01-01'),
       ('Китайская гигантская саламандра', 20075, DATE '1837-01-01'),
       ('Лев', 5840, DATE '1758-01-01'),
       ('Волк обыкновенный', 4745, DATE '1758-01-01'),
       ('Бурый медведь', 9125, DATE '1758-01-01'),
       ('Западная горилла', 12775, DATE '1847-01-01'),
       ('Индийский павлин', 7300, DATE '1758-01-01'),
       ('Императорский пингвин', 7300, DATE '1844-01-01'),
       ('Тёмный тигровый питон', 9125, DATE '1820-01-01'),
       ('Африканский страус', 14600, DATE '1758-01-01'),
       ('Синий кит', 29200, DATE '1758-01-01'),
       ('Белоголовый орлан', 9125, DATE '1766-01-01');

SELECT *
FROM fauna
WHERE name ILIKE '%домашняя%';

SELECT f.name, f.avg_age, f.discovery_date
FROM fauna f
WHERE avg_age > 10000
  AND avg_age < 20000;

SELECT *
FROM fauna
WHERE avg_age IS NULL;

SELECT *
FROM fauna
WHERE discovery_date > '1950-01-01'